project-chip/connectedhomeip/examples/platform/stm32/common/STM32WBA65I-DK1/Common/WPAN/Config/Debug_GPIO/debug_config.h
/* SCHDLR_HNDL_NXT_TRACE activation */
#undef USE_RT_DEBUG_SCHDLR_HNDL_NXT_TRACE
#define USE_RT_DEBUG_SCHDLR_HNDL_NXT_TRACE                    (1U)

/* SCHDLR_EXEC_EVNT_TRACE activation */
#undef USE_RT_DEBUG_SCHDLR_EXEC_EVNT_TRACE
#define USE_RT_DEBUG_SCHDLR_EXEC_EVNT_TRACE                   (1U)

/* PHY_CLBR_ISR activation */
#undef USE_RT_DEBUG_PHY_CLBR_ISR
#define USE_RT_DEBUG_PHY_CLBR_ISR                             (1U)

/*
 *
 * Debug configuration for MAC purpose
 *
 */
#elif (USE_RT_DEBUG_CONFIGURATION_MAC == 1U)

/* LLHWC_CMN_LW_ISR activation */
#undef USE_RT_DEBUG_LLHWC_CMN_LW_ISR
#define USE_RT_DEBUG_LLHWC_CMN_LW_ISR                         (1U)

/* LLHWC_CMN_HG_ISR activation */
#undef USE_RT_DEBUG_LLWCC_CMN_HG_ISR
#define USE_RT_DEBUG_LLWCC_CMN_HG_ISR                         (1U)

/* RAL_ISR_TRACE activation */
#undef USE_RT_DEBUG_RAL_ISR_TRACE
#define USE_RT_DEBUG_RAL_ISR_TRACE                            (1U)

/* RAL_SM_DONE_EVNT_CBK activation */
#undef USE_RT_DEBUG_RAL_SM_DONE_EVNT_CBK
#define USE_RT_DEBUG_RAL_SM_DONE_EVNT_CBK                     (1U)

/* RAL_STOP_OPRTN activation */
#undef USE_RT_DEBUG_RAL_STOP_OPRTN
#define USE_RT_DEBUG_RAL_STOP_OPRTN                           (1U)

/* RAL_STRT_RX activation */
#undef USE_RT_DEBUG_RAL_STRT_RX
#define USE_RT_DEBUG_RAL_STRT_RX                              (1U)

/* RAL_STRT_TX activation */
#undef USE_RT_DEBUG_RAL_STRT_TX
#define USE_RT_DEBUG_RAL_STRT_TX                              (1U)

/*
 *
 * Debug configuration for COEX purpose
 *
 */
#elif (USE_RT_DEBUG_CONFIGURATION_COEX == 1U)

/* COEX_ASK_FOR_AIR activation */
#undef USE_RT_DEBUG_COEX_ASK_FOR_AIR
#define USE_RT_DEBUG_COEX_ASK_FOR_AIR                         (1U)

/* COEX_FORCE_STOP_RX activation */
#undef USE_RT_DEBUG_COEX_FORCE_STOP_RX
#define USE_RT_DEBUG_COEX_FORCE_STOP_RX                       (1U)

/* COEX_STRT_ON_IDLE activation */
#undef USE_RT_DEBUG_COEX_STRT_ON_IDLE
#define USE_RT_DEBUG_COEX_STRT_ON_IDLE                        (1U)

/* COEX_STRT_ONE_SHOT activation */
#undef USE_RT_DEBUG_COEX_STRT_ONE_SHOT
#define USE_RT_DEBUG_COEX_STRT_ONE_SHOT                       (1U)

/* SCHDLR_HNDL_NXT_TRACE activation */
#undef USE_RT_DEBUG_SCHDLR_HNDL_NXT_TRACE
#define USE_RT_DEBUG_SCHDLR_HNDL_NXT_TRACE                    (1U)

/* SCHDLR_EXEC_EVNT_TRACE activation */
#undef USE_RT_DEBUG_SCHDLR_EXEC_EVNT_TRACE
#define USE_RT_DEBUG_SCHDLR_EXEC_EVNT_TRACE                   (1U)

/* RAL_SM_DONE_EVNT_CBK activation */
#undef USE_RT_DEBUG_RAL_SM_DONE_EVNT_CBK
#define USE_RT_DEBUG_RAL_SM_DONE_EVNT_CBK                     (1U)

/* RAL_STOP_OPRTN activation */
#undef USE_RT_DEBUG_RAL_STOP_OPRTN
#define USE_RT_DEBUG_RAL_STOP_OPRTN                           (1U)

#else
/* Nothing to do */
#endif /* (USE_RT_DEBUG_CONFIGURATION_COEX == 1U) */

#endif /* CFG_RT_DEBUG_GPIO_MODULE */

/******************************************************************/
/** Association table between general debug signal and used gpio **/
/******************************************************************/

#include "debug_signals.h"

#if(CFG_RT_DEBUG_GPIO_MODULE == 1)

#include "stm32wbaxx_hal.h"

typedef struct {
  GPIO_TypeDef* GPIO_port;
  uint16_t GPIO_pin;
} st_gpio_debug_t;

static const st_gpio_debug_t general_debug_table[] = {
#if (USE_RT_DEBUG_SCM_SYSTEM_CLOCK_CONFIG == 1)
  [RT_DEBUG_SCM_SYSTEM_CLOCK_CONFIG] = GPIO_DEBUG_SCM_SYSTEM_CLOCK_CONFIG,
#endif /* USE_RT_DEBUG_SCM_SYSTEM_CLOCK_CONFIG */

#if (USE_RT_DEBUG_SCM_SETUP == 1)
  [RT_DEBUG_SCM_SETUP] = GPIO_DEBUG_SCM_SETUP,
#endif /* USE_RT_DEBUG_SCM_SETUP */

#if (USE_RT_DEBUG_SCM_HSERDY_ISR == 1)
  [RT_DEBUG_SCM_HSERDY_ISR] = GPIO_DEBUG_SCM_HSERDY_ISR,
#endif /* USE_RT_DEBUG_SCM_HSERDY_ISR */

#if (USE_RT_DEBUG_ADC_ACTIVATION == 1)
  [RT_DEBUG_ADC_ACTIVATION] = GPIO_DEBUG_ADC_ACTIVATION,
#endif /* USE_RT_DEBUG_ADC_ACTIVATION */

#if (USE_RT_DEBUG_ADC_DEACTIVATION == 1)
  [RT_DEBUG_ADC_DEACTIVATION] = GPIO_DEBUG_ADC_DEACTIVATION,
#endif /* USE_RT_DEBUG_ADC_DEACTIVATION */

#if (USE_RT_DEBUG_ADC_TEMPERATURE_ACQUISITION == 1)
  [RT_DEBUG_ADC_TEMPERATURE_ACQUISITION] = GPIO_DEBUG_ADC_TEMPERATURE_ACQUISITION,
#endif /* USE_RT_DEBUG_ADC_TEMPERATURE_ACQUISITION */

#if (USE_RT_DEBUG_RNG_ENABLE == 1)
  [RT_DEBUG_RNG_ENABLE] = GPIO_DEBUG_RNG_ENABLE,
#endif /* USE_RT_DEBUG_RNG_ENABLE */

#if (USE_RT_DEBUG_RNG_DISABLE == 1)
  [RT_DEBUG_RNG_DISABLE] = GPIO_DEBUG_RNG_DISABLE,
#endif /* USE_RT_DEBUG_RNG_DISABLE */

#if (USE_RT_DEBUG_RNG_GEN_RAND_NUM == 1)
  [RT_DEBUG_RNG_GEN_RAND_NUM] = GPIO_DEBUG_RNG_GEN_RAND_NUM,
#endif /* USE_RT_DEBUG_RNG_GEN_RAND_NUM */

#if (USE_RT_DEBUG_LOW_POWER_STOP_MODE_ENTER == 1)
  [RT_DEBUG_LOW_POWER_STOP_MODE_ENTER] = GPIO_DEBUG_LOW_POWER_STOP_MODE_ENTER,
#endif /* USE_RT_DEBUG_LOW_POWER_STOP_MODE_ENTER */

#if (USE_RT_DEBUG_LOW_POWER_STOP_MODE_EXIT == 1)
  [RT_DEBUG_LOW_POWER_STOP_MODE_EXIT] = GPIO_DEBUG_LOW_POWER_STOP_MODE_EXIT,
#endif /* USE_RT_DEBUG_LOW_POWER_STOP_MODE_EXIT */

#if (USE_RT_DEBUG_LOW_POWER_STOP_MODE_ACTIVE == 1)
  [RT_DEBUG_LOW_POWER_STOP_MODE_ACTIVE] = GPIO_DEBUG_LOW_POWER_STOP_MODE_ACTIVE,
#endif /* USE_RT_DEBUG_LOW_POWER_STOP_MODE_ACTIVE */

#if (USE_RT_DEBUG_LOW_POWER_STANDBY_MODE_ENTER == 1)
  [RT_DEBUG_LOW_POWER_STANDBY_MODE_ENTER] = GPIO_DEBUG_LOW_POWER_STANDBY_MODE_ENTER,
#endif /* USE_RT_DEBUG_LOW_POWER_STANDBY_MODE_ENTER */

#if (USE_RT_DEBUG_LOW_POWER_STANDBY_MODE_EXIT == 1)
  [RT_DEBUG_LOW_POWER_STANDBY_MODE_EXIT] = GPIO_DEBUG_LOW_POWER_STANDBY_MODE_EXIT,
#endif /* USE_RT_DEBUG_LOW_POWER_STANDBY_MODE_EXIT */

#if (USE_RT_DEBUG_LOW_POWER_STANDBY_MODE_ACTIVE == 1)
  [RT_DEBUG_LOW_POWER_STANDBY_MODE_ACTIVE] = GPIO_DEBUG_LOW_POWER_STANDBY_MODE_ACTIVE,
#endif /* USE_RT_DEBUG_LOW_POWER_STANDBY_MODE_ACTIVE */

#if (USE_RT_DEBUG_HCI_READ_DONE == 1)
  [RT_DEBUG_HCI_READ_DONE] = GPIO_DEBUG_HCI_READ_DONE,
#endif /* USE_RT_DEBUG_HCI_READ_DONE */

#if (USE_RT_DEBUG_HCI_RCVD_CMD == 1)
  [RT_DEBUG_HCI_RCVD_CMD] = GPIO_DEBUG_HCI_RCVD_CMD,
#endif /* USE_RT_DEBUG_HCI_RCVD_CMD */

#if (USE_RT_DEBUG_HCI_WRITE_DONE == 1)
  [RT_DEBUG_HCI_WRITE_DONE] = GPIO_DEBUG_HCI_WRITE_DONE,
#endif /* USE_RT_DEBUG_HCI_WRITE_DONE */

#if (USE_RT_DEBUG_SCHDLR_EVNT_UPDATE == 1)
  [RT_DEBUG_SCHDLR_EVNT_UPDATE] = GPIO_DEBUG_SCHDLR_EVNT_UPDATE,
#endif /* USE_RT_DEBUG_SCHDLR_EVNT_UPDATE */

#if (USE_RT_DEBUG_SCHDLR_TIMER_SET == 1)
  [RT_DEBUG_SCHDLR_TIMER_SET] = GPIO_DEBUG_SCHDLR_TIMER_SET,
#endif /* USE_RT_DEBUG_SCHDLR_TIMER_SET */

